---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPosition
source: html/b6576b22-59f1-5cd1-962c-d65f17c198fb.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexStreamPosition

A stream that can be used to write vertices of type VertexPosition
 into a buffer (see VertexBuffer ).

## Syntax (C#)
```csharp
public class VertexStreamPosition : VertexStream
```